13/data/attachments/403cf5862fa23601.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_817dc7dd-d2fb-4e9b-a521-147a13879097</nif:username>
            <nif:friendToBeAdded>Christopher_good_Actions_56214_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>